GopalSaraf/Practicals/PSDL/include/proc/pic16lf18346.h
extern volatile CWG2DBRbits_t CWG2DBRbits __at(0x713);
// bitfield macros
#define _CWG2DBR_DBR_POSN                                   0x0
#define _CWG2DBR_DBR_POSITION                               0x0
#define _CWG2DBR_DBR_SIZE                                   0x6
#define _CWG2DBR_DBR_LENGTH                                 0x6
#define _CWG2DBR_DBR_MASK                                   0x3F
#define _CWG2DBR_DBR0_POSN                                  0x0
#define _CWG2DBR_DBR0_POSITION                              0x0
#define _CWG2DBR_DBR0_SIZE                                  0x1
#define _CWG2DBR_DBR0_LENGTH                                0x1
#define _CWG2DBR_DBR0_MASK                                  0x1
#define _CWG2DBR_DBR1_POSN                                  0x1
#define _CWG2DBR_DBR1_POSITION                              0x1
#define _CWG2DBR_DBR1_SIZE                                  0x1
#define _CWG2DBR_DBR1_LENGTH                                0x1
#define _CWG2DBR_DBR1_MASK                                  0x2
#define _CWG2DBR_DBR2_POSN                                  0x2
#define _CWG2DBR_DBR2_POSITION                              0x2
#define _CWG2DBR_DBR2_SIZE                                  0x1
#define _CWG2DBR_DBR2_LENGTH                                0x1
#define _CWG2DBR_DBR2_MASK                                  0x4
#define _CWG2DBR_DBR3_POSN                                  0x3
#define _CWG2DBR_DBR3_POSITION                              0x3
#define _CWG2DBR_DBR3_SIZE                                  0x1
#define _CWG2DBR_DBR3_LENGTH                                0x1
#define _CWG2DBR_DBR3_MASK                                  0x8
#define _CWG2DBR_DBR4_POSN                                  0x4
#define _CWG2DBR_DBR4_POSITION                              0x4
#define _CWG2DBR_DBR4_SIZE                                  0x1
#define _CWG2DBR_DBR4_LENGTH                                0x1
#define _CWG2DBR_DBR4_MASK                                  0x10
#define _CWG2DBR_DBR5_POSN                                  0x5
#define _CWG2DBR_DBR5_POSITION                              0x5
#define _CWG2DBR_DBR5_SIZE                                  0x1
#define _CWG2DBR_DBR5_LENGTH                                0x1
#define _CWG2DBR_DBR5_MASK                                  0x20
#define _CWG2DBR_CWG2DBR_POSN                               0x0
#define _CWG2DBR_CWG2DBR_POSITION                           0x0
#define _CWG2DBR_CWG2DBR_SIZE                               0x6
#define _CWG2DBR_CWG2DBR_LENGTH                             0x6
#define _CWG2DBR_CWG2DBR_MASK                               0x3F
#define _CWG2DBR_CWG2DBR0_POSN                              0x0
#define _CWG2DBR_CWG2DBR0_POSITION                          0x0
#define _CWG2DBR_CWG2DBR0_SIZE                              0x1
#define _CWG2DBR_CWG2DBR0_LENGTH                            0x1
#define _CWG2DBR_CWG2DBR0_MASK                              0x1
#define _CWG2DBR_CWG2DBR1_POSN                              0x1
#define _CWG2DBR_CWG2DBR1_POSITION                          0x1
#define _CWG2DBR_CWG2DBR1_SIZE                              0x1
#define _CWG2DBR_CWG2DBR1_LENGTH                            0x1
#define _CWG2DBR_CWG2DBR1_MASK                              0x2
#define _CWG2DBR_CWG2DBR2_POSN                              0x2
#define _CWG2DBR_CWG2DBR2_POSITION                          0x2
#define _CWG2DBR_CWG2DBR2_SIZE                              0x1
#define _CWG2DBR_CWG2DBR2_LENGTH                            0x1
#define _CWG2DBR_CWG2DBR2_MASK                              0x4
#define _CWG2DBR_CWG2DBR3_POSN                              0x3
#define _CWG2DBR_CWG2DBR3_POSITION                          0x3
#define _CWG2DBR_CWG2DBR3_SIZE                              0x1
#define _CWG2DBR_CWG2DBR3_LENGTH                            0x1
#define _CWG2DBR_CWG2DBR3_MASK                              0x8
#define _CWG2DBR_CWG2DBR4_POSN                              0x4
#define _CWG2DBR_CWG2DBR4_POSITION                          0x4
#define _CWG2DBR_CWG2DBR4_SIZE                              0x1
#define _CWG2DBR_CWG2DBR4_LENGTH                            0x1
#define _CWG2DBR_CWG2DBR4_MASK                              0x10
#define _CWG2DBR_CWG2DBR5_POSN                              0x5
#define _CWG2DBR_CWG2DBR5_POSITION                          0x5
#define _CWG2DBR_CWG2DBR5_SIZE                              0x1
#define _CWG2DBR_CWG2DBR5_LENGTH                            0x1
#define _CWG2DBR_CWG2DBR5_MASK                              0x20

// Register: CWG2DBF
#define CWG2DBF CWG2DBF
extern volatile unsigned char           CWG2DBF             __at(0x714);
#ifndef _LIB_BUILD
asm("CWG2DBF equ 0714h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBF                    :6;
    };
    struct {
        unsigned DBF0                   :1;
        unsigned DBF1                   :1;
        unsigned DBF2                   :1;
        unsigned DBF3                   :1;
        unsigned DBF4                   :1;
        unsigned DBF5                   :1;
    };
    struct {
        unsigned CWG2DBF                :6;
    };
    struct {
        unsigned CWG2DBF0               :1;
        unsigned CWG2DBF1               :1;
        unsigned CWG2DBF2               :1;
        unsigned CWG2DBF3               :1;
        unsigned CWG2DBF4               :1;
        unsigned CWG2DBF5               :1;
    };
} CWG2DBFbits_t;
extern volatile CWG2DBFbits_t CWG2DBFbits __at(0x714);
// bitfield macros
#define _CWG2DBF_DBF_POSN                                   0x0
#define _CWG2DBF_DBF_POSITION                               0x0
#define _CWG2DBF_DBF_SIZE                                   0x6
#define _CWG2DBF_DBF_LENGTH                                 0x6
#define _CWG2DBF_DBF_MASK                                   0x3F
#define _CWG2DBF_DBF0_POSN                                  0x0
#define _CWG2DBF_DBF0_POSITION                              0x0
#define _CWG2DBF_DBF0_SIZE                                  0x1
#define _CWG2DBF_DBF0_LENGTH                                0x1
#define _CWG2DBF_DBF0_MASK                                  0x1
#define _CWG2DBF_DBF1_POSN                                  0x1
#define _CWG2DBF_DBF1_POSITION                              0x1
#define _CWG2DBF_DBF1_SIZE                                  0x1
#define _CWG2DBF_DBF1_LENGTH                                0x1
#define _CWG2DBF_DBF1_MASK                                  0x2
#define _CWG2DBF_DBF2_POSN                                  0x2
#define _CWG2DBF_DBF2_POSITION                              0x2
#define _CWG2DBF_DBF2_SIZE                                  0x1
#define _CWG2DBF_DBF2_LENGTH                                0x1
#define _CWG2DBF_DBF2_MASK                                  0x4
#define _CWG2DBF_DBF3_POSN                                  0x3
#define _CWG2DBF_DBF3_POSITION                              0x3
#define _CWG2DBF_DBF3_SIZE                                  0x1
#define _CWG2DBF_DBF3_LENGTH                                0x1
#define _CWG2DBF_DBF3_MASK                                  0x8
#define _CWG2DBF_DBF4_POSN                                  0x4
#define _CWG2DBF_DBF4_POSITION                              0x4
#define _CWG2DBF_DBF4_SIZE                                  0x1
#define _CWG2DBF_DBF4_LENGTH                                0x1
#define _CWG2DBF_DBF4_MASK                                  0x10
#define _CWG2DBF_DBF5_POSN                                  0x5
#define _CWG2DBF_DBF5_POSITION                              0x5
#define _CWG2DBF_DBF5_SIZE                                  0x1
#define _CWG2DBF_DBF5_LENGTH                                0x1
#define _CWG2DBF_DBF5_MASK                                  0x20
#define _CWG2DBF_CWG2DBF_POSN                               0x0
#define _CWG2DBF_CWG2DBF_POSITION                           0x0
#define _CWG2DBF_CWG2DBF_SIZE                               0x6
#define _CWG2DBF_CWG2DBF_LENGTH                             0x6
#define _CWG2DBF_CWG2DBF_MASK                               0x3F
#define _CWG2DBF_CWG2DBF0_POSN                              0x0
#define _CWG2DBF_CWG2DBF0_POSITION                          0x0
#define _CWG2DBF_CWG2DBF0_SIZE                              0x1
#define _CWG2DBF_CWG2DBF0_LENGTH                            0x1
#define _CWG2DBF_CWG2DBF0_MASK                              0x1
#define _CWG2DBF_CWG2DBF1_POSN                              0x1
#define _CWG2DBF_CWG2DBF1_POSITION                          0x1
#define _CWG2DBF_CWG2DBF1_SIZE                              0x1
#define _CWG2DBF_CWG2DBF1_LENGTH                            0x1
#define _CWG2DBF_CWG2DBF1_MASK                              0x2
#define _CWG2DBF_CWG2DBF2_POSN                              0x2
#define _CWG2DBF_CWG2DBF2_POSITION                          0x2
#define _CWG2DBF_CWG2DBF2_SIZE                              0x1
#define _CWG2DBF_CWG2DBF2_LENGTH                            0x1
#define _CWG2DBF_CWG2DBF2_MASK                              0x4
#define _CWG2DBF_CWG2DBF3_POSN                              0x3
#define _CWG2DBF_CWG2DBF3_POSITION                          0x3
#define _CWG2DBF_CWG2DBF3_SIZE                              0x1
#define _CWG2DBF_CWG2DBF3_LENGTH                            0x1
#define _CWG2DBF_CWG2DBF3_MASK                              0x8
#define _CWG2DBF_CWG2DBF4_POSN                              0x4
#define _CWG2DBF_CWG2DBF4_POSITION                          0x4
#define _CWG2DBF_CWG2DBF4_SIZE                              0x1
#define _CWG2DBF_CWG2DBF4_LENGTH                            0x1
#define _CWG2DBF_CWG2DBF4_MASK                              0x10
#define _CWG2DBF_CWG2DBF5_POSN                              0x5
#define _CWG2DBF_CWG2DBF5_POSITION                          0x5
#define _CWG2DBF_CWG2DBF5_SIZE                              0x1
#define _CWG2DBF_CWG2DBF5_LENGTH                            0x1
#define _CWG2DBF_CWG2DBF5_MASK                              0x20

